{
  "en": {
    "name": "PAVEL BISWAS",
    "title": "Full Stack Developer & Team Leader",
    "region": "India",
    "contact": {
      "phone": "+91-7980809639",
      "email": "pavelbiswas@gmail.com",
      "linkedin": "https://www.linkedin.com/in/pavel-biswas-05721648/",
      "relocation": "Готов к релокации при получении разрешения на работу"
    },
    "summary": "A highly skilled full-stack developer with 8+ years of experience working with JavaScript and extensive expertise in modern frontend frameworks, including React.js, Redux, and their ecosystem. Proficient in SSO and Web Authentication, with a strong foundation in JavaScript, CSS, and web technologies. Adept at leading architecture discussions, integrating AI-driven automation, and optimizing frontend performance for scalable applications.\n\n• Working as a Team Leader for a group of UI developers.\n• Navigation Specialist with 4 years of experience in the updation and development of map making of diverse set of data sets present all over the world. Have explored the different algorithms used in Database Analysis.\n• Expert at analyzing the problem and working towards to produce the satisfactory result.\n• Skilled with programming languages like Node.js and Python preferably ESRI ArcPy.\n• Published and presented 5 national research papers in Colleges & Universities.\n• Able to stretch the boundaries to learn new technologies and tools as per the requirement.",
    "skills": {
      "Programming Languages": ["JavaScript", "Python", "Node.js", "TypeScript"],
      "Databases": ["MySQL", "SQLite", "Maria DB", "MongoDB", "Oracle SQL"],
      "Frontend": ["React", "Angular", "HTML5", "CSS3", "Redux", "Next.js", "Backbone JS"],
      "Backend": ["Node.js", "Python", "Oracle Netsuite SCA"],
      "UI/UX": ["HTML5", "CSS3", "Web Page Anatomy", "WCAG 2.1 Compliance", "Figma"],
      "Security & Authentication": ["SSO", "OAuth", "Web Authentication"],
      "Testing Tools": ["Jest", "Karma", "Jasmine"],
      "Report & BI Tools": ["Power BI", "Tableau", "JIRA", "Asana", "EazyBI"],
      "CMS & Headless": ["ArcXP", "Arc Engine", "ArcPro", "ArcPy"],
      "3D & Visualization": ["Three.js"],
      "Version Control": ["Git"],
      "Microsoft Technologies": ["MS Office"]
    },
    "education": [
      {
        "degree": "MSc",
        "school": "Symbiosis International University",
        "field": "Post-Graduate Studies",
        "year": "2013"
      },
      {
        "degree": "BSc",
        "school": "University of Calcutta",
        "field": "Undergraduate Studies",
        "year": "2011"
      }
    ],
    "experience": [
      {
        "company": "Techmango",
        "title": "Assistant Tech Lead",
        "period": "July 2025 - Present",
        "description": "Working as an Arc XP developer for web apps like Beacon Media for publications as a migration project. Working as a Migration counterpart for the Orthofi legacy system to React. Managing other junior developers and troubleshooting their queries. Actively participating in the project management scenario with prior experience and advice.",
        "technologies": ["React", "Arc XP", "Angular JS"]
      },
      {
        "company": "ESRI India",
        "title": "Senior Analyst",
        "period": "Nov 2024 - May 2025",
        "description": "Working as a full stack developer for web apps like trenching, sewerage and complaints management projects under Government clients. Integrated Power BI dashboards for spatial and infrastructure metrics using DAX and custom visuals. Managing other junior developers and troubleshooting their queries. Actively participating in the project management scenario with prior experience and advice.",
        "technologies": ["JavaScript", "Oracle SQL Developer", "Python", "JIRA"]
      },
      {
        "company": "GIR Software Services LLP",
        "title": "Sr. Software Developer / Assistant Project Manager",
        "period": "July 2023 - Oct 2024",
        "description": "Worked on Oracle Netsuite SEO for ERP Projects (Primary Arms, Primary Arms Wholesale, Primary Arms Sports), mostly on the frontend. Implemented ArcXP headless CMS features for content-driven projects requiring modular and scalable editorial workflows. Customized ArcXP templates for dynamic content publishing and SEO optimization within eCommerce and ERP environments. Delivered client-specific Power BI reports for procurement and performance metrics using Power Query and DAX. Created Custom Content Type and SCA integration with Backend. Club Car – Developed a virtual golf tournament system, enabling real-time modifications of golf pins and dynamic cart movement tracking within a simulated environment. Metaverse 3D Building Projects – Implemented interactive 3D building designs using Three.js, creating immersive spatial visualization for digital environments. Howard Hughes – Tin Building Project – Designed and built the frontend architecture of a shopping mall management platform using React.js and Next.js, enhancing user experience and performance. Later, as an Assistant Project Manager, worked on JIRA, handling project migrations and utilizing EazyBI for dashboard creation and report generation.",
        "technologies": ["Backbone JS", "Oracle Netsuite SCA", "Three.js", "React.js", "Next.js", "JIRA", "EazyBI", "DAX", "Power BI", "ArcXP"]
      },
      {
        "company": "Ajackus",
        "title": "Sr. Software Developer",
        "period": "August 2021 - March 2023",
        "description": "Worked on WCAG 2.1 standards for semantic HTML in the Visa Project using Angular 7 for motor disabled people. Worked on WCAG Compliance Expert for Visa VCS in Frontend Framework. Designed and developed features (button, checkboxes) of Frontend for VCS-Loyalty application for Visa using their own process which includes using Angular 7. Completed developing tabs and pages related to application and routing parts. Completed development on Visa Loyalty Credit card format of Email templates. Integrated ArcXP CMS to manage editorial workflows and frontend template rendering for SEO-optimized loyalty campaign pages. Customized ArcXP modules to support scalable content delivery across multilingual regions and responsive devices.",
        "technologies": ["Angular 7", "HTML", "CSS", "Bootstrap", "ArcXP", "WCAG 2.1"]
      },
      {
        "company": "ULTS",
        "title": "Developer Analyst",
        "period": "July 2019 - September 2021",
        "description": "Worked as an Angular lead for e-niyamasabha (a project of KLA or Kerala Legislative Assembly). Worked in small CMS projects related to SPA developments. Worked in UI/UX designing for various iOS and mobile applications related to IOT and Web Development. Developed CMS applications for Kerala Assembly and telehealth platforms. Created interactive Tableau and Power BI dashboards for data-driven decision-making. Architected modular UI using Angular and contributed to BI and reporting pipelines. Used Tableau for data analytics and report generation for software to generate food coupons. Led a team of 16 people in front-end/UI development. Worked as a Solution Architect for various projects among which notable is IPMS (Intelligent Property Tax Management) Kerala.",
        "technologies": ["Angular 2", "Angular 8", "React", "HTML", "CSS", "Javascript", "Figma", "Tableau", "Node.js", "Redux", "Power BI", "DAX"]
      },
      {
        "company": "Tomtom India Pvt Limited",
        "title": "GIS Developer",
        "period": "June 2014 - July 2019",
        "description": "Developed maps and navigation routes through FME and embed maps for pedestrian projects using Big data. Worked in UI/UX designing and Tableau for reporting and data analysis dashboards and also application developments. Strong customer-facing and selling skills with strong analytical and problem-solving skills and diversification.",
        "technologies": ["Arc SDE", "FME", "ArcPy", "Arc Engine", "ArcPro", "Tableau", "Node.js", "React.js"]
      },
      {
        "company": "Trillium Technologies LLC",
        "title": "Team Lead",
        "period": "Oct 2019 - Mar 2020",
        "description": "Worked for Telehealth Project as a Team Lead/Project Manager for a group of 6 Developers. Managed development team, coordinated project deliverables, and ensured quality standards across the development lifecycle.",
        "technologies": ["React.js", "Node.js", "MongoDB"]
      }
    ],
    "publications": [
      {
        "title": "Published and presented 5 national research papers in Colleges & Universities",
        "year": "2011-2013"
      }
    ]
  },
  "ru": {
    "name": "ПАВЕЛ БИСВАС",
    "title": "Full Stack разработчик и Team Leader",
    "region": "Индия",
    "contact": {
      "phone": "+91-7980809639",
      "email": "pavelbiswas@gmail.com",
      "linkedin": "https://www.linkedin.com/in/pavel-biswas-05721648/"
    },
    "summary": "Высокопрофессиональный full-stack разработчик с 8+ годами опыта работы с JavaScript и обширным опытом в современных фреймворках frontend, включая React.js, Redux и их экосистему. Владею SSO и Web Authentication, имею сильную базу в JavaScript, CSS и веб-технологиях. Опытен в проведении архитектурных дискуссий, интеграции AI-автоматизации и оптимизации производительности frontend для масштабируемых приложений.",
    "skills": {
      "Языки программирования": ["JavaScript", "Python", "Node.js", "TypeScript"],
      "Базы данных": ["MySQL", "SQLite", "Maria DB", "MongoDB", "Oracle SQL"],
      "Frontend": ["React", "Angular", "HTML5", "CSS3", "Redux", "Next.js", "Backbone JS"],
      "Backend": ["Node.js", "Python", "Oracle Netsuite SCA"],
      "UI/UX": ["HTML5", "CSS3", "Web Page Anatomy", "WCAG 2.1 Compliance", "Figma"],
      "Безопасность & Аутентификация": ["SSO", "OAuth", "Web Authentication"],
      "Инструменты тестирования": ["Jest", "Karma", "Jasmine"],
      "Инструменты отчетности": ["Power BI", "Tableau", "JIRA", "Asana", "EazyBI"],
      "CMS & Headless": ["ArcXP", "Arc Engine", "ArcPro", "ArcPy"],
      "3D & Визуализация": ["Three.js"],
      "Контроль версий": ["Git"],
      "Microsoft технологии": ["MS Office"]
    },
    "education": [
      {
        "degree": "MSc",
        "school": "Symbiosis International University",
        "field": "Post-Graduate Studies",
        "year": "2013"
      },
      {
        "degree": "BSc",
        "school": "University of Calcutta",
        "field": "Undergraduate Studies",
        "year": "2011"
      }
    ],
    "experience": [
      {
        "company": "Techmango",
        "title": "Assistant Tech Lead",
        "period": "July 2025 - Present",
        "description": "Работаю разработчиком Arc XP для веб-приложений как Beacon Media для публикаций в проекте миграции. Работаю как партнер по миграции для системы Orthofi в React. Управляю младшими разработчиками и решаю их проблемы. Активно участвую в проектной деятельности с предварительным опытом и советами.",
        "technologies": ["React", "Arc XP", "Angular JS"]
      },
      {
        "company": "ESRI India",
        "title": "Senior Analyst",
        "period": "Nov 2024 - May 2025",
        "description": "Работаю full stack разработчиком для веб-приложений таких как проекты траншей, канализации и управления жалобами для государственных клиентов. Интегрировал информационные панели Power BI для пространственных и инфраструктурных показателей с использованием DAX и пользовательских визуализаций. Управляю младшими разработчиками и решаю их вопросы.",
        "technologies": ["JavaScript", "Oracle SQL Developer", "Python", "JIRA"]
      },
      {
        "company": "GIR Software Services LLP",
        "title": "Sr. Software Developer / Assistant Project Manager",
        "period": "July 2023 - Oct 2024",
        "description": "Работал над Oracle Netsuite SEO для ERP проектов, в основном на frontend. Внедрил функции ArcXP headless CMS для проектов, ориентированных на контент. Настроил шаблоны ArcXP для динамической публикации контента и оптимизации SEO. Разработал систему виртуального турнира по гольфу и интерактивные 3D проекты с использованием Three.js. Разработал архитектуру платформы управления торговым центром с использованием React.js и Next.js.",
        "technologies": ["Backbone JS", "Oracle Netsuite SCA", "Three.js", "React.js", "Next.js", "JIRA", "EazyBI", "DAX", "Power BI", "ArcXP"]
      },
      {
        "company": "Ajackus",
        "title": "Sr. Software Developer",
        "period": "August 2021 - March 2023",
        "description": "Работал над стандартами WCAG 2.1 для семантического HTML в проекте Visa с использованием Angular 7. Разработал функции для приложения VCS-Loyalty для Visa. Интегрировал ArcXP CMS для управления рабочими потоками редактирования и отрисовкой шаблонов frontend, оптимизированными для SEO.",
        "technologies": ["Angular 7", "HTML", "CSS", "Bootstrap", "ArcXP", "WCAG 2.1"]
      },
      {
        "company": "ULTS",
        "title": "Developer Analyst",
        "period": "July 2019 - September 2021",
        "description": "Работал как Angular lead для проекта e-niyamasabha (проект Kerala Legislative Assembly). Разработал CMS приложения для Kerala Assembly и telehealth платформ. Создал интерактивные информационные панели Tableau и Power BI. Руководил командой из 16 человек в разработке front-end/UI. Работал как Solution Architect для различных проектов, включая IPMS (Intelligent Property Tax Management) Kerala.",
        "technologies": ["Angular 2", "Angular 8", "React", "HTML", "CSS", "Javascript", "Figma", "Tableau", "Node.js", "Redux", "Power BI", "DAX"]
      },
      {
        "company": "Tomtom India Pvt Limited",
        "title": "GIS Developer",
        "period": "June 2014 - July 2019",
        "description": "Разработал карты и маршруты навигации через FME и встраивал карты для пешеходных проектов с использованием Big Data. Работал над дизайном UI/UX и Tableau для информационных панелей отчетности и анализа данных. Отличные навыки работы с клиентами и сильные аналитические способности.",
        "technologies": ["Arc SDE", "FME", "ArcPy", "Arc Engine", "ArcPro", "Tableau", "Node.js", "React.js"]
      },
      {
        "company": "Trillium Technologies LLC",
        "title": "Team Lead",
        "period": "Oct 2019 - Mar 2020",
        "description": "Работал для Telehealth проекта как Team Lead/Project Manager для группы из 6 разработчиков. Управлял командой разработки, координировал доставку проекта и обеспечивал стандарты качества.",
        "technologies": ["React.js", "Node.js", "MongoDB"]
      }
    ],
    "publications": [
      {
        "title": "Опубликовано и представлено 5 национальных исследовательских работ в колледжах и университетах",
        "year": "2011-2013"
      }
    ]
  }
}
